#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ДействуетНаОсновании");
	Поля.Добавить("Наименование");    
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ДействуетНаОсновании <> "" Тогда
		
		Представление = Данные.ДействуетНаОсновании + " " + Данные.Наименование; 
	Иначе 
		Представление = Данные.Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти