#Область ПрограммныйИнтерфейс

// Дополняет форму реквизитами
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить команды.
//
Процедура ДополнитьФорму(Форма) Экспорт
	
	//ПАК начало
	ИмяФормы = Форма.ИмяФормы; 
	
	//для разных документов чутка разное поведение при добавлении элементов
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВгруппаШапкаПраво(Форма);  
		ДобавитьПолеИКомандуСкидки(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВгруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВгруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда  
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли; 
	//ПАК конец
	
КонецПроцедуры        


Процедура ДобавитьПолеКонтактноеЛицоВгруппаШапкаПраво(Форма) 
	
	//ПАК начало
	//Добавляется контактное лицо на форму в группу ГруппаШапкаПраво
	ПолеВвода = Форма.Элементы.Добавить("New_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.New_КонтактноеЛицо";  
	//ПАК конец
	
КонецПроцедуры


Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)  
	
	//ПАК начало
	//Добавляется контактное лицо на форму перед суммой документа
	ПолеВвода = Форма.Элементы.Вставить("New_КонтактноеЛицо", Тип("ПолеФормы"), Форма, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.New_КонтактноеЛицо";  
	//ПАК конец
	
КонецПроцедуры   

Процедура ВставитьПолеКонтактноеЛицоНаФормуОснование(Форма)  
	
	//ПАК начало
	//Добавляется контактное лицо на форму перед суммой документа
	ПолеВвода = Форма.Элементы.Вставить("New_КонтактноеЛицо", Тип("ПолеФормы"), Форма, Форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.New_КонтактноеЛицо";  
	//ПАК конец
	
КонецПроцедуры 

Процедура ДобавитьПолеИКомандуСкидки(Форма)  
	
	//ПАК начало
	//для нормального отображения добавляется новая группа ГруппаСкидки 
	ГруппаОбъектов = Форма.Элементы.Добавить("ГруппаСкидки", Тип("ГруппаФормы"), Форма);
	ГруппаОбъектов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаОбъектов.Заголовок = "ГруппаСкидки"; 
	ГруппаОбъектов.ОтображатьЗаголовок = Ложь;       
	
	//данная группа перемещена в нормальное место, а то она добавляется в конце формы
	Форма.Элементы.Переместить(Форма.Элементы.ГруппаСкидки, Форма, Форма.Элементы.Страницы);  
	
	//добавляется поле со скидкой 
	ПолеВвода = Форма.Элементы.Добавить("New_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидки);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.New_СогласованнаяСкидка"; 
	ПолеВвода.УстановитьДействие("ПриИзменении", "ОбработчикПриИзмененииСкидки");  
	
	//добавляется кнопка на форму
	ПолеКоманда = Форма.Элементы.Добавить("РассчитатьСкидку", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидки);
	ПолеКоманда.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	ПолеКоманда.ИмяКоманды = "РассчитатьСкидку";     
	//ПАК конец
	
КонецПроцедуры    

#КонецОбласти